{"config": [{"config": {"unroll": false, "go_backwards": false, "recurrent_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dropout": 0.0, "stateful": false, "batch_input_shape": [null, 120, 3], "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "return_sequences": true, "bias_regularizer": null, "unit_forget_bias": true, "trainable": true, "implementation": 0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "lstm_1", "units": 50, "activity_regularizer": null, "recurrent_dropout": 0.0, "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "activation": "tanh", "kernel_constraint": null, "return_state": false}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"unroll": false, "recurrent_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dropout": 0.0, "stateful": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "return_sequences": true, "bias_regularizer": null, "unit_forget_bias": true, "trainable": true, "implementation": 0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "lstm_2", "units": 50, "kernel_regularizer": null, "recurrent_dropout": 0.0, "go_backwards": false, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "activation": "tanh", "kernel_constraint": null, "return_state": false}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"unroll": false, "recurrent_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dropout": 0.0, "stateful": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "return_sequences": false, "bias_regularizer": null, "unit_forget_bias": true, "trainable": true, "implementation": 0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "lstm_3", "units": 50, "kernel_regularizer": null, "recurrent_dropout": 0.0, "go_backwards": false, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "activation": "tanh", "kernel_constraint": null, "return_state": false}, "class_name": "LSTM"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "units": 1, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Dense"}], "keras_version": "2.0.8", "backend": "tensorflow", "class_name": "Sequential"}